vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7128.inc
T_T3LD                         EQU       T3LD      -T3BASE    
T_T3VAL                        EQU       T3VAL     -T3BASE    
T_T3CON                        EQU       T3CON     -T3BASE    
T_T3ICLR                       EQU       T3ICLR    -T3BASE    

T3LD_OFFSET                    EQU       0x0360
T3VAL_OFFSET                   EQU       0x0364
T3CON_OFFSET                   EQU       0x0368
T3ICLR_OFFSET                  EQU       0x036C

; GENERAL PURPOSE TIMER 4

T4BASE                         EQU       0xFFFF0380
T4LD                           EQU       0xFFFF0380
T4VAL                          EQU       0xFFFF0384
T4CON                          EQU       0xFFFF0388
T4ICLR                         EQU       0xFFFF038C
T4CAP                          EQU       0xFFFF0390
Z_T4LD                         EQU       T4LD      -Z_BASE
Z_T4VAL                        EQU       T4VAL     -Z_BASE
Z_T4CON                        EQU       T4CON     -Z_BASE
Z_T4ICLR                       EQU       T4ICLR    -Z_BASE
Z_T4CAP                        EQU       T4CAP     -Z_BASE

T_T4LD                         EQU       T4LD      -T4BASE    
T_T4VAL                        EQU       T4VAL     -T4BASE    
T_T4CON                        EQU       T4CON     -T4BASE    
T_T4ICLR                       EQU       T4ICLR    -T4BASE    
T_T4CAP                        EQU       T4CAP     -T4BASE    

T4LD_OFFSET                    EQU       0x0380
T4VAL_OFFSET                   EQU       0x0384
T4CON_OFFSET                   EQU       0x0388
T4ICLR_OFFSET                  EQU       0x038C
T4CAP_OFFSET                   EQU       0x0390

; PLL AND OSCILLATOR CONTROL

PLLBASE                        EQU       0xFFFF0400
POWKEY1                        EQU       0xFFFF0404
POWCON                         EQU       0xFFFF0408
POWKEY2                        EQU       0xFFFF040C
PLLKEY1                        EQU       0xFFFF0410
PLLCON                         EQU       0xFFFF0414
PLLKEY2                        EQU       0xFFFF0418
Z_POWKEY1                      EQU       POWKEY1   -Z_BASE
Z_POWCON                       EQU       POWCON    -Z_BASE
Z_POWKEY2                      EQU       POWKEY2   -Z_BASE
Z_PLLKEY1                      EQU       PLLKEY1   -Z_BASE
Z_PLLCON                       EQU       PLLCON    -Z_BASE
Z_PLLKEY2                      EQU       PLLKEY2   -Z_BASE

T_POWKEY1                      EQU       POWKEY1   -PLLBASE   
T_POWCON                       EQU       POWCON    -PLLBASE   
T_POWKEY2                      EQU       POWKEY2   -PLLBASE   
T_PLLKEY1                      EQU       PLLKEY1   -PLLBASE   
T_PLLCON                       EQU       PLLCON    -PLLBASE   
T_PLLKEY2                      EQU       PLLKEY2   -PLLBASE   

POWKEY1_OFFSET                 EQU       0x0404
POWCON_OFFSET                  EQU       0x0408
POWKEY2_OFFSET                 EQU       0x040C
PLLKEY1_OFFSET                 EQU       0x0410
PLLCON_OFFSET                  EQU       0x0414
PLLKEY2_OFFSET                 EQU       0x0418

; POWER SUPPLY MONITOR

PSMBASE                        EQU       0xFFFF0440
PSMCON                         EQU       0xFFFF0440
CMPCON                         EQU       0xFFFF0444
Z_PSMCON                       EQU       PSMCON    -Z_BASE
Z_CMPCON                       EQU       CMPCON    -Z_BASE

T_PSMCON                       EQU       PSMCON    -PSMBASE   
T_CMPCON                       EQU       CMPCON    -PSMBASE   

PSMCON_OFFSET                  EQU       0x0440
CMPCON_OFFSET                  EQU       0x0444

; Band Gap Reference

REFBASE                        EQU       0xFFFF0480
REFCON                         EQU       0xFFFF048C
Z_REFCON                       EQU       REFCON    -Z_BASE

T_REFCON                       EQU       REFCON    -REFBASE   

REFCON_OFFSET                  EQU       0x048C

; ADC INTERFACE REGISTERS

ADCBASE                        EQU       0xFFFF0500
ADCCON                         EQU       0xFFFF0500
ADCCP                          EQU       0xFFFF0504
ADCCN                          EQU       0xFFFF0508
ADCSTA                         EQU       0xFFFF050C
ADCDAT                         EQU       0xFFFF0510
ADCRST                         EQU       0xFFFF0514
ADCGN                          EQU       0xFFFF0530
ADCOF                          EQU       0xFFFF0534
Z_ADCCON                       EQU       ADCCON    -Z_BASE
Z_ADCCP                        EQU       ADCCP     -Z_BASE
Z_ADCCN                        EQU       ADCCN     -Z_BASE
Z_ADCSTA                       EQU       ADCSTA    -Z_BASE
Z_ADCDAT                       EQU       ADCDAT    -Z_BASE
Z_ADCRST                       EQU       ADCRST    -Z_BASE
Z_ADCGN                        EQU       ADCGN     -Z_BASE
Z_ADCOF                        EQU       ADCOF     -Z_BASE

T_ADCCON                       EQU       ADCCON    -ADCBASE   
T_ADCCP                        EQU       ADCCP     -ADCBASE   
T_ADCCN                        EQU       ADCCN     -ADCBASE   
T_ADCSTA                       EQU       ADCSTA    -ADCBASE   
T_ADCDAT                       EQU       ADCDAT    -ADCBASE   
T_ADCRST                       EQU       ADCRST    -ADCBASE   
T_ADCGN                        EQU       ADCGN     -ADCBASE   
T_ADCOF                        EQU       ADCOF     -ADCBASE   

ADCCON_OFFSET                  EQU       0x0500
ADCCP_OFFSET                   EQU       0x0504
ADCCN_OFFSET                   EQU       0x0508
ADCSTA_OFFSET                  EQU       0x050C
ADCDAT_OFFSET                  EQU       0x0510
ADCRST_OFFSET                  EQU       0x0514
ADCGN_OFFSET                   EQU       0x0530
ADCOF_OFFSET                   EQU       0x0534

; DAC INTERFACE REGISTERS

DACBASE                        EQU       0xFFFF0670
DACCON                         EQU       0xFFFF0670
DACDAT                         EQU       0xFFFF06B4
Z_DACCON                       EQU       DACCON    -Z_BASE
Z_DACDAT                       EQU       DACDAT    -Z_BASE

