vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7128.inc
COM1TX_OFFSET                  EQU       0x0740
COM1RX_OFFSET                  EQU       0x0740
COM1DIV0_OFFSET                EQU       0x0740
COM1IEN0_OFFSET                EQU       0x0744
COM1DIV1_OFFSET                EQU       0x0744
COM1IID0_OFFSET                EQU       0x0748
COM1CON0_OFFSET                EQU       0x074C
COM1CON1_OFFSET                EQU       0x0750
COM1STA0_OFFSET                EQU       0x0754
COM1STA1_OFFSET                EQU       0x0758
COM1SCR_OFFSET                 EQU       0x075C
COM1IEN1_OFFSET                EQU       0x0760
COM1IID1_OFFSET                EQU       0x0764
COM1ADR_OFFSET                 EQU       0x0768
COM1DIV2_OFFSET                EQU       0x076C

; I2C BUS PERIPHERAL DEVICE 0

I2C0BASE                       EQU       0xFFFF0800
I2C0MSTA                       EQU       0xFFFF0800
I2C0SSTA                       EQU       0xFFFF0804
I2C0SRX                        EQU       0xFFFF0808
I2C0STX                        EQU       0xFFFF080C
I2C0MRX                        EQU       0xFFFF0810
I2C0MTX                        EQU       0xFFFF0814
I2C0CNT                        EQU       0xFFFF0818
I2C0ADR                        EQU       0xFFFF081C
I2C0BYT                        EQU       0xFFFF0824
I2C0ALT                        EQU       0xFFFF0828
I2C0CFG                        EQU       0xFFFF082C
I2C0DIV                        EQU       0xFFFF0830
I2C0ID0                        EQU       0xFFFF0838
I2C0ID1                        EQU       0xFFFF083C
I2C0ID2                        EQU       0xFFFF0840
I2C0ID3                        EQU       0xFFFF0844
I2C0SSC                        EQU       0xFFFF0848
I2C0FIF                        EQU       0xFFFF084C
Z_I2C0MSTA                     EQU       I2C0MSTA  -Z_BASE
Z_I2C0SSTA                     EQU       I2C0SSTA  -Z_BASE
Z_I2C0SRX                      EQU       I2C0SRX   -Z_BASE
Z_I2C0STX                      EQU       I2C0STX   -Z_BASE
Z_I2C0MRX                      EQU       I2C0MRX   -Z_BASE
Z_I2C0MTX                      EQU       I2C0MTX   -Z_BASE
Z_I2C0CNT                      EQU       I2C0CNT   -Z_BASE
Z_I2C0ADR                      EQU       I2C0ADR   -Z_BASE
Z_I2C0BYT                      EQU       I2C0BYT   -Z_BASE
Z_I2C0ALT                      EQU       I2C0ALT   -Z_BASE
Z_I2C0CFG                      EQU       I2C0CFG   -Z_BASE
Z_I2C0DIV                      EQU       I2C0DIV   -Z_BASE
Z_I2C0ID0                      EQU       I2C0ID0   -Z_BASE
Z_I2C0ID1                      EQU       I2C0ID1   -Z_BASE
Z_I2C0ID2                      EQU       I2C0ID2   -Z_BASE
Z_I2C0ID3                      EQU       I2C0ID3   -Z_BASE
Z_I2C0SSC                      EQU       I2C0SSC   -Z_BASE
Z_I2C0FIF                      EQU       I2C0FIF   -Z_BASE

T_I2C0MSTA                     EQU       I2C0MSTA  -I2C0BASE  
T_I2C0SSTA                     EQU       I2C0SSTA  -I2C0BASE  
T_I2C0SRX                      EQU       I2C0SRX   -I2C0BASE  
T_I2C0STX                      EQU       I2C0STX   -I2C0BASE  
T_I2C0MRX                      EQU       I2C0MRX   -I2C0BASE  
T_I2C0MTX                      EQU       I2C0MTX   -I2C0BASE  
T_I2C0CNT                      EQU       I2C0CNT   -I2C0BASE  
T_I2C0ADR                      EQU       I2C0ADR   -I2C0BASE  
T_I2C0BYT                      EQU       I2C0BYT   -I2C0BASE  
T_I2C0ALT                      EQU       I2C0ALT   -I2C0BASE  
T_I2C0CFG                      EQU       I2C0CFG   -I2C0BASE  
T_I2C0DIV                      EQU       I2C0DIV   -I2C0BASE  
T_I2C0ID0                      EQU       I2C0ID0   -I2C0BASE  
T_I2C0ID1                      EQU       I2C0ID1   -I2C0BASE  
T_I2C0ID2                      EQU       I2C0ID2   -I2C0BASE  
T_I2C0ID3                      EQU       I2C0ID3   -I2C0BASE  
T_I2C0SSC                      EQU       I2C0SSC   -I2C0BASE  
T_I2C0FIF                      EQU       I2C0FIF   -I2C0BASE  

I2C0MSTA_OFFSET                EQU       0x0800
I2C0SSTA_OFFSET                EQU       0x0804
I2C0SRX_OFFSET                 EQU       0x0808
I2C0STX_OFFSET                 EQU       0x080C
I2C0MRX_OFFSET                 EQU       0x0810
I2C0MTX_OFFSET                 EQU       0x0814
I2C0CNT_OFFSET                 EQU       0x0818
I2C0ADR_OFFSET                 EQU       0x081C
I2C0BYT_OFFSET                 EQU       0x0824
I2C0ALT_OFFSET                 EQU       0x0828
I2C0CFG_OFFSET                 EQU       0x082C
I2C0DIV_OFFSET                 EQU       0x0830
I2C0ID0_OFFSET                 EQU       0x0838
I2C0ID1_OFFSET                 EQU       0x083C
I2C0ID2_OFFSET                 EQU       0x0840
I2C0ID3_OFFSET                 EQU       0x0844
I2C0SSC_OFFSET                 EQU       0x0848
I2C0FIF_OFFSET                 EQU       0x084C

; I2C BUS PERIPHERAL DEVICE 1

I2C1BASE                       EQU       0xFFFF0900
I2C1MSTA                       EQU       0xFFFF0900
I2C1SSTA                       EQU       0xFFFF0904
I2C1SRX                        EQU       0xFFFF0908
I2C1STX                        EQU       0xFFFF090C
I2C1MRX                        EQU       0xFFFF0910
I2C1MTX                        EQU       0xFFFF0914
I2C1CNT                        EQU       0xFFFF0918
I2C1ADR                        EQU       0xFFFF091C
I2C1BYT                        EQU       0xFFFF0924
I2C1ALT                        EQU       0xFFFF0928
I2C1CFG                        EQU       0xFFFF092C
I2C1DIV                        EQU       0xFFFF0930
I2C1ID0                        EQU       0xFFFF0938
I2C1ID1                        EQU       0xFFFF093C
I2C1ID2                        EQU       0xFFFF0940
I2C1ID3                        EQU       0xFFFF0944
I2C1SSC                        EQU       0xFFFF0948
I2C1FIF                        EQU       0xFFFF094C
Z_I2C1MSTA                     EQU       I2C1MSTA  -Z_BASE
Z_I2C1SSTA                     EQU       I2C1SSTA  -Z_BASE
Z_I2C1SRX                      EQU       I2C1SRX   -Z_BASE
Z_I2C1STX                      EQU       I2C1STX   -Z_BASE
Z_I2C1MRX                      EQU       I2C1MRX   -Z_BASE
Z_I2C1MTX                      EQU       I2C1MTX   -Z_BASE
Z_I2C1CNT                      EQU       I2C1CNT   -Z_BASE
Z_I2C1ADR                      EQU       I2C1ADR   -Z_BASE
Z_I2C1BYT                      EQU       I2C1BYT   -Z_BASE
Z_I2C1ALT                      EQU       I2C1ALT   -Z_BASE
Z_I2C1CFG                      EQU       I2C1CFG   -Z_BASE
Z_I2C1DIV                      EQU       I2C1DIV   -Z_BASE
Z_I2C1ID0                      EQU       I2C1ID0   -Z_BASE
Z_I2C1ID1                      EQU       I2C1ID1   -Z_BASE
Z_I2C1ID2                      EQU       I2C1ID2   -Z_BASE
Z_I2C1ID3                      EQU       I2C1ID3   -Z_BASE
Z_I2C1SSC                      EQU       I2C1SSC   -Z_BASE
Z_I2C1FIF                      EQU       I2C1FIF   -Z_BASE

