vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7128.inc
T_I2C1MSTA                     EQU       I2C1MSTA  -I2C1BASE  
T_I2C1SSTA                     EQU       I2C1SSTA  -I2C1BASE  
T_I2C1SRX                      EQU       I2C1SRX   -I2C1BASE  
T_I2C1STX                      EQU       I2C1STX   -I2C1BASE  
T_I2C1MRX                      EQU       I2C1MRX   -I2C1BASE  
T_I2C1MTX                      EQU       I2C1MTX   -I2C1BASE  
T_I2C1CNT                      EQU       I2C1CNT   -I2C1BASE  
T_I2C1ADR                      EQU       I2C1ADR   -I2C1BASE  
T_I2C1BYT                      EQU       I2C1BYT   -I2C1BASE  
T_I2C1ALT                      EQU       I2C1ALT   -I2C1BASE  
T_I2C1CFG                      EQU       I2C1CFG   -I2C1BASE  
T_I2C1DIV                      EQU       I2C1DIV   -I2C1BASE  
T_I2C1ID0                      EQU       I2C1ID0   -I2C1BASE  
T_I2C1ID1                      EQU       I2C1ID1   -I2C1BASE  
T_I2C1ID2                      EQU       I2C1ID2   -I2C1BASE  
T_I2C1ID3                      EQU       I2C1ID3   -I2C1BASE  
T_I2C1SSC                      EQU       I2C1SSC   -I2C1BASE  
T_I2C1FIF                      EQU       I2C1FIF   -I2C1BASE  

I2C1MSTA_OFFSET                EQU       0x0900
I2C1SSTA_OFFSET                EQU       0x0904
I2C1SRX_OFFSET                 EQU       0x0908
I2C1STX_OFFSET                 EQU       0x090C
I2C1MRX_OFFSET                 EQU       0x0910
I2C1MTX_OFFSET                 EQU       0x0914
I2C1CNT_OFFSET                 EQU       0x0918
I2C1ADR_OFFSET                 EQU       0x091C
I2C1BYT_OFFSET                 EQU       0x0924
I2C1ALT_OFFSET                 EQU       0x0928
I2C1CFG_OFFSET                 EQU       0x092C
I2C1DIV_OFFSET                 EQU       0x0930
I2C1ID0_OFFSET                 EQU       0x0938
I2C1ID1_OFFSET                 EQU       0x093C
I2C1ID2_OFFSET                 EQU       0x0940
I2C1ID3_OFFSET                 EQU       0x0944
I2C1SSC_OFFSET                 EQU       0x0948
I2C1FIF_OFFSET                 EQU       0x094C

; SERIAL PERIPHERAL INTERFACE

SPIBASE                        EQU       0xFFFF0A00
SPISTA                         EQU       0xFFFF0A00
SPIRX                          EQU       0xFFFF0A04
SPITX                          EQU       0xFFFF0A08
SPIDIV                         EQU       0xFFFF0A0C
SPICON                         EQU       0xFFFF0A10
Z_SPISTA                       EQU       SPISTA    -Z_BASE
Z_SPIRX                        EQU       SPIRX     -Z_BASE
Z_SPITX                        EQU       SPITX     -Z_BASE
Z_SPIDIV                       EQU       SPIDIV    -Z_BASE
Z_SPICON                       EQU       SPICON    -Z_BASE

T_SPISTA                       EQU       SPISTA    -SPIBASE   
T_SPIRX                        EQU       SPIRX     -SPIBASE   
T_SPITX                        EQU       SPITX     -SPIBASE   
T_SPIDIV                       EQU       SPIDIV    -SPIBASE   
T_SPICON                       EQU       SPICON    -SPIBASE   

SPISTA_OFFSET                  EQU       0x0A00
SPIRX_OFFSET                   EQU       0x0A04
SPITX_OFFSET                   EQU       0x0A08
SPIDIV_OFFSET                  EQU       0x0A0C
SPICON_OFFSET                  EQU       0x0A10

; PROGRAMABLE LOGIC ARRAY

PLABASE                        EQU       0xFFFF0B00
PLAELM0                        EQU       0xFFFF0B00
PLAELM1                        EQU       0xFFFF0B04
PLAELM2                        EQU       0xFFFF0B08
PLAELM3                        EQU       0xFFFF0B0C
PLAELM4                        EQU       0xFFFF0B10
PLAELM5                        EQU       0xFFFF0B14
PLAELM6                        EQU       0xFFFF0B18
PLAELM7                        EQU       0xFFFF0B1C
PLAELM8                        EQU       0xFFFF0B20
PLAELM9                        EQU       0xFFFF0B24
PLAELM10                       EQU       0xFFFF0B28
PLAELM11                       EQU       0xFFFF0B2C
PLAELM12                       EQU       0xFFFF0B30
PLAELM13                       EQU       0xFFFF0B34
PLAELM14                       EQU       0xFFFF0B38
PLAELM15                       EQU       0xFFFF0B3C
PLACLK                         EQU       0xFFFF0B40
PLAIRQ                         EQU       0xFFFF0B44
PLAADC                         EQU       0xFFFF0B48
PLADIN                         EQU       0xFFFF0B4C
PLAOUT                         EQU       0xFFFF0B50
Z_PLAELM0                      EQU       PLAELM0   -Z_BASE
Z_PLAELM1                      EQU       PLAELM1   -Z_BASE
Z_PLAELM2                      EQU       PLAELM2   -Z_BASE
Z_PLAELM3                      EQU       PLAELM3   -Z_BASE
Z_PLAELM4                      EQU       PLAELM4   -Z_BASE
Z_PLAELM5                      EQU       PLAELM5   -Z_BASE
Z_PLAELM6                      EQU       PLAELM6   -Z_BASE
Z_PLAELM7                      EQU       PLAELM7   -Z_BASE
Z_PLAELM8                      EQU       PLAELM8   -Z_BASE
Z_PLAELM9                      EQU       PLAELM9   -Z_BASE
Z_PLAELM10                     EQU       PLAELM10  -Z_BASE
Z_PLAELM11                     EQU       PLAELM11  -Z_BASE
Z_PLAELM12                     EQU       PLAELM12  -Z_BASE
Z_PLAELM13                     EQU       PLAELM13  -Z_BASE
Z_PLAELM14                     EQU       PLAELM14  -Z_BASE
Z_PLAELM15                     EQU       PLAELM15  -Z_BASE
Z_PLACLK                       EQU       PLACLK    -Z_BASE
Z_PLAIRQ                       EQU       PLAIRQ    -Z_BASE
Z_PLAADC                       EQU       PLAADC    -Z_BASE
Z_PLADIN                       EQU       PLADIN    -Z_BASE
Z_PLAOUT                       EQU       PLAOUT    -Z_BASE

T_PLAELM0                      EQU       PLAELM0   -PLABASE   
T_PLAELM1                      EQU       PLAELM1   -PLABASE   
T_PLAELM2                      EQU       PLAELM2   -PLABASE   
T_PLAELM3                      EQU       PLAELM3   -PLABASE   
T_PLAELM4                      EQU       PLAELM4   -PLABASE   
T_PLAELM5                      EQU       PLAELM5   -PLABASE   
T_PLAELM6                      EQU       PLAELM6   -PLABASE   
T_PLAELM7                      EQU       PLAELM7   -PLABASE   
T_PLAELM8                      EQU       PLAELM8   -PLABASE   
T_PLAELM9                      EQU       PLAELM9   -PLABASE   
T_PLAELM10                     EQU       PLAELM10  -PLABASE   
T_PLAELM11                     EQU       PLAELM11  -PLABASE   
T_PLAELM12                     EQU       PLAELM12  -PLABASE   
T_PLAELM13                     EQU       PLAELM13  -PLABASE   
T_PLAELM14                     EQU       PLAELM14  -PLABASE   
T_PLAELM15                     EQU       PLAELM15  -PLABASE   
T_PLACLK                       EQU       PLACLK    -PLABASE   
T_PLAIRQ                       EQU       PLAIRQ    -PLABASE   
T_PLAADC                       EQU       PLAADC    -PLABASE   
T_PLADIN                       EQU       PLADIN    -PLABASE   
T_PLAOUT                       EQU       PLAOUT    -PLABASE   

PLAELM0_OFFSET                 EQU       0x0B00
PLAELM1_OFFSET                 EQU       0x0B04
PLAELM2_OFFSET                 EQU       0x0B08
PLAELM3_OFFSET                 EQU       0x0B0C
PLAELM4_OFFSET                 EQU       0x0B10
PLAELM5_OFFSET                 EQU       0x0B14
PLAELM6_OFFSET                 EQU       0x0B18
PLAELM7_OFFSET                 EQU       0x0B1C
PLAELM8_OFFSET                 EQU       0x0B20
PLAELM9_OFFSET                 EQU       0x0B24
PLAELM10_OFFSET                EQU       0x0B28
PLAELM11_OFFSET                EQU       0x0B2C
PLAELM12_OFFSET                EQU       0x0B30
PLAELM13_OFFSET                EQU       0x0B34
PLAELM14_OFFSET                EQU       0x0B38
PLAELM15_OFFSET                EQU       0x0B3C
PLACLK_OFFSET                  EQU       0x0B40
PLAIRQ_OFFSET                  EQU       0x0B44
PLAADC_OFFSET                  EQU       0x0B48
PLADIN_OFFSET                  EQU       0x0B4C
PLAOUT_OFFSET                  EQU       0x0B50

; External Port

